In [1]:
import pandas as pd

In [2]:
data = [['tom', 10], ['nick', 15], ['juli', 14]]

In [5]:
#Create a dataframe

df = pd.DataFrame(data, columns = ['Name', 'Age'])

In [6]:
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [7]:
df["Null_Column"] = None

In [8]:
df

   Name  Age Null_Column
0   tom   10        None
1  nick   15        None
2  juli   14        None

In [11]:
#Drop column if all values are null 
df.dropna(axis = 1, how ='all', inplace = True)

In [12]:
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [13]:
df["Null_Column"] = None

In [14]:
df

   Name  Age Null_Column
0   tom   10        None
1  nick   15        None
2  juli   14        None

In [15]:
df["Null_Column_2"] = None

In [16]:
df

   Name  Age Null_Column Null_Column_2
0   tom   10        None          None
1  nick   15        None          None
2  juli   14        None          None

In [17]:
df.fillna(value='ABC', axis='columns')

   Name  Age Null_Column Null_Column_2
0   tom   10         ABC           ABC
1  nick   15         ABC           ABC
2  juli   14         ABC           ABC

In [23]:
#you can fill selected column with a value
#You can finally replace the df
df["new_col"] = df[['Null_Column_2']].fillna(value='ABC', axis='columns')

In [24]:
df

   Name  Age Null_Column Null_Column_2 new_col
0   tom   10        None          None     ABC
1  nick   15        None          None     ABC
2  juli   14        None          None     ABC

In [25]:
df[['Null_Column_2']] = df[['Null_Column_2']].fillna(value='ABC', axis='columns')

In [26]:
df

   Name  Age Null_Column Null_Column_2 new_col
0   tom   10        None           ABC     ABC
1  nick   15        None           ABC     ABC
2  juli   14        None           ABC     ABC

In [28]:
#select rows, where given column has a specified value
df.loc[df['Age'] == 15]

   Name  Age Null_Column Null_Column_2 new_col
1  nick   15        None           ABC     ABC

In [30]:
#select a given value, example imagine it is a matrix, and you want to select matrix[i][j]
df.loc[df['Age'] == 15, 'Null_Column_2']

1    ABC
Name: Null_Column_2, dtype: object

In [31]:
df.loc[df['Age'] == 15, 'Null_Column_2'] = None

In [32]:
df

   Name  Age Null_Column Null_Column_2 new_col
0   tom   10        None           ABC     ABC
1  nick   15        None          None     ABC
2  juli   14        None           ABC     ABC

In [35]:
#replace non value for a given column by value="ABC2"
df[['Null_Column_2']] = df[['Null_Column_2']].fillna(value='ABC2', axis='columns')

In [36]:
df

   Name  Age Null_Column Null_Column_2 new_col
0   tom   10        None           ABC     ABC
1  nick   15        None          ABC2     ABC
2  juli   14        None           ABC     ABC